package lec_05.tasks.loop;
/*
Вывод чисел от 1 до 10.
Напишите программу, которая выводит числа от 1 до 10, используя цикл for.
 */
public class L1 {
    static void main(String[] args) {
        for (int i = 1; i < 11; i++){
            System.out.print(i + " ");
        }
    }
}
